Reports/ОстаткиНаСкладах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Report>
		<Properties>
			<Name>ОстаткиНаСкладах</Name>
		</Properties>
	</Report>
</MetaDataObject>

AccumulationRegisters/УчетНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<AccumulationRegister>
		<Properties>
			<Name>УчетНоменклатуры</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>13</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Reports/ОстаткиНаСкладах/Ext/ObjectModule.bsl
Процедура ОстаткиНаСкладах(ТабДок) Экспорт

	Макет = ПолучитьМакет("ОстаткиНаСкладах");
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	УчетНоменклатурыОстатки.Номенклатура КАК Номенклатура,
	|	УчетНоменклатурыОстатки.Номенклатура.Представление,
	|	УчетНоменклатурыОстатки.Склад КАК Склад,
	|	УчетНоменклатурыОстатки.Склад.Представление,
	|	УчетНоменклатурыОстатки.КоличествоОстаток КАК КоличествоОстаток
	|ИЗ
	|	РегистрНакопления.УчетНоменклатуры.Остатки КАК УчетНоменклатурыОстатки
	|
	|ИТОГИ СУММА(КоличествоОстаток) ПО
	|	ОБЩИЕ,
	|	Номенклатура,
	|	Склад";

	Результат = Запрос.Выполнить();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ОбластьНоменклатура = Макет.ПолучитьОбласть("Номенклатура");
	ОбластьСклад = Макет.ПолучитьОбласть("Склад");
	ОбластьСкладШапка = Макет.ПолучитьОбласть("СкладШапка");
	ОбластьЗаголовкаИтога = Макет.ПолучитьОбласть("ЗаголовокИтога");
	ОбластьИтогПоКолонке = Макет.ПолучитьОбласть("ИтогПоКолонке");
	ОбластьИтогПоСтроке = Макет.ПолучитьОбласть("ИтогПоСтроке");
	ОбластьЗаголовокИтогаПоСтроке = Макет.ПолучитьОбласть("ЗаголовокИтогаПоСтроке");
	ОбластьОбщийИтог = Макет.ПолучитьОбласть("ОбщийИтог");

	ТабДок.Вывести(ОбластьЗаголовок);
	ТабДок.Вывести(ОбластьШапкаТаблицы);

	ВыборкаСкладИтог = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Склад");

	Пока ВыборкаСкладИтог.Следующий() Цикл
		ОбластьСкладШапка.Параметры.Заполнить(ВыборкаСкладИтог);
		ТабДок.Присоединить(ОбластьСкладШапка);
	КонецЦикла;
	
	ТабДок.Присоединить(ОбластьЗаголовокИтогаПоСтроке);
		
	ВыборкаНоменклатура = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Номенклатура");

	Пока ВыборкаНоменклатура.Следующий() Цикл
		ОбластьНоменклатура.Параметры.Заполнить(ВыборкаНоменклатура);
		ТабДок.Вывести(ОбластьНоменклатура);

		ВыборкаСклад = ВыборкаНоменклатура.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Склад", "ВСЕ");

		Пока ВыборкаСклад.Следующий() Цикл
			ОбластьСклад.Параметры.Заполнить(ВыборкаСклад);
			ТабДок.Присоединить(ОбластьСклад);
		КонецЦикла;
		
		ОбластьИтогПоСтроке.Параметры.Заполнить(ВыборкаНоменклатура);
		ТабДок.Присоединить(ОбластьИтогПоСтроке);
	КонецЦикла;
	
	ТабДок.Вывести(ОбластьЗаголовкаИтога);
	ВыборкаСкладИтог.Сбросить();
	Пока ВыборкаСкладИтог.Следующий() Цикл
		ОбластьИтогПоКолонке.Параметры.Заполнить(ВыборкаСкладИтог);
		ТабДок.Присоединить(ОбластьИтогПоКолонке);
	КонецЦикла;

	ВыборкаОбщийИтог = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаОбщийИтог.Следующий();
	ОбластьОбщийИтог.Параметры.Заполнить(ВыборкаОбщийИтог);
	ТабДок.Присоединить(ОбластьОбщийИтог);	
	ТабДок.Вывести(ОбластьПодвал);

КонецПроцедуры
